# Modul 2: Pandas

In [51]:
# pip install numpy

In [1]:
# import libraries
import numpy as np
import pandas as pd

## 1. Create Series

- Series mirip dengan 1D array
- Series bisa kita anggap sebagai 1 kolom dalam sebuah tabel

**membuat series menggunakan list**

In [3]:
list_number = [10,20,30,40]
list_label = ['a','b','c','d']

pd.Series(data=list_number, index=list_label)

a    10
b    20
c    30
d    40
dtype: int64

**membuat series menggunakan array**

In [4]:
myArray = np.arange(10,41,10)

pd.Series(data=myArray, index=list_label)

a    10
b    20
c    30
d    40
dtype: int64

**membuat series menggunakan dictionary**

In [5]:
myDict = {'x':11, 'y':12, 'z':13}

pd.Series(data=myDict)
# key akan menjadi label index
# value akan menjadi itemnya

x    11
y    12
z    13
dtype: int64

In [6]:
myDict = {'x':11, 'y':12, 'z':13.7}
pd.Series(data=myDict)
# kalau 1 item ada yg float, maka semua item berubah jadi float

x    11.0
y    12.0
z    13.7
dtype: float64

In [7]:
myDict = {'x':11, 'y':'12', 'z':13.7}
pd.Series(data=myDict)
# kalau 1 item ada yg string, maka semua item berubah jadi string (object)

x      11
y      12
z    13.7
dtype: object

## 2. Create DataFrame

- Mirip dengan 2D 
- DataFrame bisa kita anggap sebagai table

**menggunakan list**

In [9]:
kota = ['Jakarta', 'Padang', 'Ambon']
toko = [10, 5, 3]
profit = [9000, 5000, 12000] 

pd.DataFrame(data=[kota, toko, profit])

         0       1      2
0  Jakarta  Padang  Ambon
1       10       5      3
2     9000    5000  12000

In [10]:
[kota, toko, profit]

[['Jakarta', 'Padang', 'Ambon'], [10, 5, 3], [9000, 5000, 12000]]

In [11]:
# zip memasangkan item pada index yg sama dalam sebuah tuple
list(zip(kota, toko, profit))

[('Jakarta', 10, 9000), ('Padang', 5, 5000), ('Ambon', 3, 12000)]

In [12]:
pd.DataFrame(data=zip(kota, toko, profit))

         0   1      2
0  Jakarta  10   9000
1   Padang   5   5000
2    Ambon   3  12000

In [13]:
import string
string.ascii_lowercase

'abcdefghijklmnopqrstuvwxyz'

In [14]:
df = pd.DataFrame(
    data= zip(kota, toko, profit),
    index= ['a','b','c'],
    columns= ['kota', 'toko', 'profit']   
)

df

      kota  toko  profit
a  Jakarta    10    9000
b   Padang     5    5000
c    Ambon     3   12000

**menggunakan array**

In [15]:
array_2D = np.arange(1,16).reshape(3,5)
array_2D

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15]])

In [16]:
pd.DataFrame(data=array_2D)

    0   1   2   3   4
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15

**menggunakan dictionary**

In [17]:
# list dalam dictionary
dict_toko = {
    'kota': ['jakarta', 'padang', 'ambon'],
    'toko': [10,5,3],
    'profit': [9000, 5000, 12000]
}

pd.DataFrame(data=dict_toko)

      kota  toko  profit
0  jakarta    10    9000
1   padang     5    5000
2    ambon     3   12000

In [18]:
# dictionary dalam dictionary
dict1 = {1001: {'nama':'jisoo', 'umur':25},
         1002: {'nama':'rose', 'umur':24}}

df1 = pd.DataFrame(data=dict1).transpose()
df1

       nama umur
1001  jisoo   25
1002   rose   24

**Soal**

In [19]:
# buat dictionary untuk datanya
dict_salary = {
    'name':['Kim Jisoo', 'Robert Downey', 'Johny Depp', 'Harry Maguire', 'Ana De Armas'],
    'gender':['F','M','M','M','F'],
    'hire_date':['2018-05-01', '2017-08-01', '2018-11-01', '2019-02-01', '2017-03-01'],
    'salary':[7000, 9000, 8000, 4000, 9000]
}

# buat list berisi nomor karyawan untuk indexnya
emp_number = np.arange(1001,1006)

# membuat dataframe dan disimpan dalam varieble df
df = pd.DataFrame(dict_salary, index=emp_number)
df

               name gender   hire_date  salary
1001      Kim Jisoo      F  2018-05-01    7000
1002  Robert Downey      M  2017-08-01    9000
1003     Johny Depp      M  2018-11-01    8000
1004  Harry Maguire      M  2019-02-01    4000
1005   Ana De Armas      F  2017-03-01    9000

## 3. Indexing

In [20]:
df

               name gender   hire_date  salary
1001      Kim Jisoo      F  2018-05-01    7000
1002  Robert Downey      M  2017-08-01    9000
1003     Johny Depp      M  2018-11-01    8000
1004  Harry Maguire      M  2019-02-01    4000
1005   Ana De Armas      F  2017-03-01    9000

In [21]:
# df.index.name = 'index'  # mau memberi header/nama pada label index
# df

In [22]:
# indexing 1 kolom
df['name']

1001        Kim Jisoo
1002    Robert Downey
1003       Johny Depp
1004    Harry Maguire
1005     Ana De Armas
Name: name, dtype: object

In [23]:
# indexing banyak kolom (fancy indexing-> item-item dimasukkan dalam list)
df[['name','salary','gender']]

               name  salary gender
1001      Kim Jisoo    7000      F
1002  Robert Downey    9000      M
1003     Johny Depp    8000      M
1004  Harry Maguire    4000      M
1005   Ana De Armas    9000      F

In [24]:
df[['name']] 
# kalau dimasukkan dalam list walaupun cuma 1 kolom, tetap akan ditampilkan sebagai DataFrame

               name
1001      Kim Jisoo
1002  Robert Downey
1003     Johny Depp
1004  Harry Maguire
1005   Ana De Armas

In [79]:
# attribute access (not recommended, takutnya nama kolom sama dengan attribute di pandas)
df.name

1001        Kim Jisoo
1002    Robert Downey
1003       Johny Depp
1004    Harry Maguire
1005     Ana De Armas
Name: name, dtype: object

In [80]:
# indexing 1 baris (ditampilkan dalam betuk series)
df.loc[1002]

name         Robert Downey
gender                   M
hire_date       2017-08-01
salary                9000
Name: 1002, dtype: object

In [81]:
# indexing lebih dari 1 baris (fancy indexing) --> ditampilkan dalam bentuk dataframe
df.loc[[1002, 1004]]

               name gender   hire_date  salary
1002  Robert Downey      M  2017-08-01    9000
1004  Harry Maguire      M  2019-02-01    4000

In [82]:
df.loc[[1002]]

               name gender   hire_date  salary
1002  Robert Downey      M  2017-08-01    9000

In [85]:
# df.loc[start,stop] --> start include, stop include
df.loc[1002:1005]

               name gender   hire_date  salary
1002  Robert Downey      M  2017-08-01    9000
1003     Johny Depp      M  2018-11-01    8000
1004  Harry Maguire      M  2019-02-01    4000
1005   Ana De Armas      F  2017-03-01    9000

In [89]:
# ambil baris 1002 sampai 1004, hanya kolom name dan gender
df.loc[1002:1004][['name', 'gender']]

               name gender
1002  Robert Downey      M
1003     Johny Depp      M
1004  Harry Maguire      M

In [95]:
# ambil baris 1002 sampai 1004, hanya kolom name dan gender
df[['name', 'gender']].loc[1002:1004]

               name gender
1002  Robert Downey      M
1003     Johny Depp      M
1004  Harry Maguire      M

In [98]:
# df.loc[row, column]
df.loc[1002:1004, ['name','gender']]

               name gender
1002  Robert Downey      M
1003     Johny Depp      M
1004  Harry Maguire      M

In [101]:
# ambil semua baris, dan kolom name sampai hire_date
df.loc[: , 'name':'hire_date']

               name gender   hire_date
1001      Kim Jisoo      F  2018-05-01
1002  Robert Downey      M  2017-08-01
1003     Johny Depp      M  2018-11-01
1004  Harry Maguire      M  2019-02-01
1005   Ana De Armas      F  2017-03-01

In [103]:
# ambil gajinya johny depp
df.loc[1003, 'salary']

8000

In [105]:
df['salary'][1003]

8000

In [111]:
df.loc[[1003], ['salary']] # ditampilkan dalam dataframe

      salary
1003    8000

In [114]:
# indexing dengan iloc
# df.iloc[urutan_row, urutan_column] 

df.iloc[2, 3]

8000

In [115]:
df.iloc[[2], [3]]

      salary
1003    8000

In [118]:
# tampilkan 3 baris pertama, kolom hire_date dan salary
df.iloc[0:3, 2:]

# dengan iloc: start include, stop exclude

       hire_date  salary
1001  2018-05-01    7000
1002  2017-08-01    9000
1003  2018-11-01    8000

In [119]:
# soal: tampilkan name dan salary dari johny depp dan harry maguire
df

               name gender   hire_date  salary
1001      Kim Jisoo      F  2018-05-01    7000
1002  Robert Downey      M  2017-08-01    9000
1003     Johny Depp      M  2018-11-01    8000
1004  Harry Maguire      M  2019-02-01    4000
1005   Ana De Armas      F  2017-03-01    9000

In [120]:
# cara 1: pakai loc
df.loc[1003:1004, ['name','salary']]

               name  salary
1003     Johny Depp    8000
1004  Harry Maguire    4000

In [124]:
# cara 2: pakai iloc
df.iloc[2:4, 0::3]

               name  salary
1003     Johny Depp    8000
1004  Harry Maguire    4000

In [125]:
df.iloc[2:4, [0,3]]

               name  salary
1003     Johny Depp    8000
1004  Harry Maguire    4000

## 4. Conditional Indexing

Mencari baris berdasarkan kondisi yg True

In [127]:
df

               name gender   hire_date  salary
1001      Kim Jisoo      F  2018-05-01    7000
1002  Robert Downey      M  2017-08-01    9000
1003     Johny Depp      M  2018-11-01    8000
1004  Harry Maguire      M  2019-02-01    4000
1005   Ana De Armas      F  2017-03-01    9000

In [129]:
# kondisi
df['name'] == 'Ana De Armas'

1001    False
1002    False
1003    False
1004    False
1005     True
Name: name, dtype: bool

In [130]:
# conditional indexing
# df[kondisi]

df[df['name'] == 'Ana De Armas']

              name gender   hire_date  salary
1005  Ana De Armas      F  2017-03-01    9000

In [133]:
# soal: tampilkan karyawan yg salary-nya lebih dari 7000
df[df['salary']>7000]

               name gender   hire_date  salary
1002  Robert Downey      M  2017-08-01    9000
1003     Johny Depp      M  2018-11-01    8000
1005   Ana De Armas      F  2017-03-01    9000

In [134]:
# menampilkan karyawan yg salary-nya lebih dari 7000 dan gendernya M

# kondisi 1
df['salary']>7000

1001    False
1002     True
1003     True
1004    False
1005     True
Name: salary, dtype: bool

In [135]:
# kondisi 2
df['gender']=='M'

1001    False
1002     True
1003     True
1004     True
1005    False
Name: gender, dtype: bool

In [136]:
# df[(kondisi1) & (kondisi2)]

# &: and --> semua kondisi harus True
# |: or  --> salah satu kondisi harus True

df[(df['salary']>7000) & (df['gender']=='M')]

               name gender   hire_date  salary
1002  Robert Downey      M  2017-08-01    9000
1003     Johny Depp      M  2018-11-01    8000